БухЭксп/Reports/CW_ОтчетАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ОтчетАгента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/Reports/CW_ОтчетАгента/Forms/ФормаОтчетаУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	Если Параметры.Свойство("Договор", Договор) Тогда 
		Контрагент = Договор.Владелец;
		СфромироватьПриОткрытии = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяДата());
		КонецПериода  = КонецМесяца(ТекущаяДата());
	КонецЕсли;	
	
	Если СфромироватьПриОткрытии Тогда 
		СформироватьОтчет();
	Иначе 
		_ВосстановитьСеансовуюНастройку(); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_СкрытьНастройки(); 
	
КонецПроцедуры

&НаСервере
Процедура _СкрытьНастройки(Скрыть = Неопределено)
	
	Если Скрыть = Неопределено Тогда
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка    = Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка    = Истина;
		КонецЕсли; 
		
	Иначе 
		Элементы.ГруппаНастройки.Видимость = НЕ Скрыть;
		Элементы.ФормаНастройка.Пометка    = НЕ Скрыть;
		
	КонецЕсли; 
		
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод;
	Диалог.Период.ДатаНачала = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПериод <> Неопределено) Тогда
		НачалоПериода = ОтветПериод.ДатаНачала;
		КонецПериода  = ОтветПериод.ДатаОкончания;
		//Период = ОтветПериод;
	КонецЕсли;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("Контрагент", Контрагент);
			СеансоваяНастройка.Свойство("Договор", Договор);
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Контрагент", Контрагент);
	СтруктураНастройки.Вставить("Договор", Договор);
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
		
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		_УФК.ВывестиПредупреждение("Не указан контрагент!");
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		_УФК.ВывестиПредупреждение("Не указан договор!");
		Возврат;
	КонецЕсли; 
	
	//Если Не ЗначениеЗаполнено(Договор.НомерДоговора) или Не ЗначениеЗаполнено(Договор.ДатаДоговора) Тогда
	//	Сообщить("Проверте корректность заполнения даты и номера договора!"); 								
	//КонецЕсли; 							

	Если (КонецПериода < НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) ИЛИ НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
		_УФК.ВывестиПредупреждение("Неверно задан период!");
		Возврат;
	КонецЕсли; 
	
	//_Настройка(Истина);
	СформироватьОтчет();
	//ОбработатьОтчет();
		
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
		
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ОтчетИнициализация();
	ОтчетОбъект.Контрагент = Контрагент;
	ОтчетОбъект.Договор    = Договор;
	ОтчетОбъект.ПриложениеКДоговору    = ПриложениеКДоговору;
	ОтчетОбъект.НачПериода = НачалоПериода;
	ОтчетОбъект.КонПериода = КонецПериода;
	флУспешно = ОтчетОбъект.ОтчетВывести(Результат);
	_СкрытьНастройки(флУспешно);
	Элементы.Результат.ОтображениеСостояния.Видимость = НЕ флУспешно;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ?(флУспешно, ДополнительныйРежимОтображения.НеИспользовать, ДополнительныйРежимОтображения.Неактуальность);
	
	// --- 
	_СохранитьСеансовуюНастройку();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("Контрагент", Контрагент);
	Настройки.ДополнительныеСвойства.Вставить("Договор", Договор);
	//Настройки.ДополнительныеСвойства.Вставить("НачалоПериода", НачалоПериода);
	//Настройки.ДополнительныеСвойства.Вставить("КонецПериода", КонецПериода);
	//Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);

КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()

	ПриложениеКДоговору = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()

	//Подсистема.УчетПриложенийДоговоров
	ДанныеФормы = Новый Структура("Договор", Договор);
	CW_УчетПриложенийДоговоровСервер.УстановитьПараметрФункциональнойОпции(ЭтаФорма, ДанныеФормы);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры
